{
    "products": [
        {
            "name": "Teclado Gamer Redragon ",
            "price": 245.45,
            "img": "/images/teclado.png",
            "description": "Teclado Mecânico Gamer Redragon Fizz K617 RGB Preto Compacto",
            "id": 1,
            "category": "teclado"
        },
        {
            "name": "Headset Logitech H151 Stereo Preto, 981-000587",
            "price": 100,
            "img": "/images/headset.png",
            "description": "Arco de cabeça e fones acolchoados e macios proporcionam o melhor conforto.Áudio aprimorado digitalmente garante qualidade premium de som. \nMicrofone rotativo com cancelamento de ruído. \nCompatível com Windows, Mac ou ChromeOS. \nControle de volume e mudo em linha com indicador em LED de mudo.",
            "id": 2,
            "category": "headset"
        },
        {
            "name": "Placa De Vídeo Gigabyte AMD Radeon RX 7600 Gaming OC, 8GB, GDDR6, FSR, Ray Tracing, GV-R76GAMING OC-8GD",
            "price": 5999.99,
            "img": "/images/placa.png",
            "description": "Marca: Gigabyte \nModelo: GV-R76GAMING OC-8GD \nCore Clock: Boost Clock* : up to 2755 MHz (Reference card: 2655 MHz) Game Clock* : up to 2355 MHz (Reference card: 2250 MHz) \nStream Processors: 2048 \nMemory Clock:  18 Gbps \nMemory Size:  8 GB \nMemory Type: GDDR6 \nMemory Bus: 128 bit \nCard Bus: PCI-E 4.0 \nDigital max resolution: 7680x4320 \nMulti-view: 4 \nCard size: L=282 W=115 H=50 mm \nPCB Form: ATX \nDirectX: 12 Ultimate \nOpenGL: 4.6 \nPower Connectors:  8 pin*1 \nOutput: DisplayPort 1.4a *2 \nHDMI 2.1a *2",
            "id": 3,
            "category": "placa"
        },
        {
            "name": "Teclado Gamer SuperFrame Origins, RGB, Switch Brown, ABNT2, USB, Preto, SF-KB-ORBRFSBRUAB",
            "price": 679.99,
            "img": "/images/teclado.png",
            "description": "O Teclado Gamer SuperFrame Origins se destaca por sua construção robusta e foco em proporcionar uma experiência de jogo otimizada. Equipado com switches Brown, conhecidos por sua resposta rápida e sensibilidade ao toque, o teclado oferece uma vantagem significativa em jogos que exigem tempos de resposta rápidos e precisão. \n \n Os switches mecânicos Brown são conhecidos por oferecer uma experiência tátil suave, com um leve feedback que ajuda a perceber o acionamento das teclas, sem o som mais alto dos switches Blue. Esse tipo de switch é ideal para quem procura precisão em jogos, mas também quer uma sensação agradável ao digitar, sendo uma excelente opção híbrida para uso misto entre trabalho e entretenimento. \n \n O SuperFrame Origins segue o padrão ABNT2, o que significa que ele possui o layout brasileiro com a tecla 'ç', tornando-o uma opção confortável e familiar para os usuários no Brasil. Essa característica é especialmente importante para quem precisa utilizar o teclado tanto para jogos quanto para tarefas cotidianas, como escrever documentos ou mensagens.",
            "id": 4,
            "category": "teclado"
        },
        {
            "name": "Headset Gamer Fifine SuperFrame Edition SFH6, 7.1 Surround, Drivers de 50mm, RGB, USB, Whiteeste",
            "price": 95.5,
            "img": "/images/headset.png",
            "description": "Graças ao som surround virtual 7.1, você terá  vantagem sobre os outros jogadores. Você será capaz de ouvir passos ou tiros para reagir cedo, e até mesmo saber que seus adversários estão andando em terra ou água. Colocando o headset, você teráum som de alta qualidade, o que te fará mergulhar no mundo dos jogos. Caracterizado com cores RGB, o headset complementará seu setup. Ele tem uma luz vívida e brilhante. A iluminação moderada, elegante e atraente, é uma adição legal quando em jogos de vídeo e cenas de streaming ao vivo. \n \n Feito de material confortável, a pressão da almofada da bandana e dos protetores de ouvido em sua cabeça e na orelha. Mesmo se for um usuário de óculos, você pode desfrutar de estender sessões de jogo, sem incômodos. Você pode esticar a bandana para ajustar em sua cabeça, e o headset não irá beliscar suas orelhas ou cabelo.",
            "id": 5,
            "category": "headset"
        },
        {
            "name": "Placa de Vídeo INNO3D GeForce RTX 3060 TWIN X2, 12GB, GDDR6, DLSS, Ray Tracing, N30602-12D6-119032AH",
            "price": 999,
            "img": "/images/placa.png",
            "description": "A poderosa placa GeForce RTX 3060TWIN X2 acelera seu trabalho com incríveis melhorias no desempenho. Esteja você fazendo edição de vídeo, animação 3D, fotografia, design gráfico, visualização arquitetônica ou transmissão, você pode economizar muito tempo. \n \n O Ray Tracing é uma forma de renderização de gráficos 3D por computador, que até então não era aplicada aos games por limitações técnicas e, agora, é o grande diferencial das placas de vídeo de nova geração, que prometem oferecer imagens cada vez mais realistas e impressionantes.",
            "id": 6,
            "category": "placa"
        },
        {
            "name": "Teclado Mecânico Gamer Redragon Castor, RGB, Switch Brown, ABNT2, White and Pink, K631WP-RGB",
            "price": 235.5,
            "img": "/images/teclado.png",
            "description": "Apesar de seu design discreto, o Redragon Castor possui iluminação RGB Chroma com diversos efeitos, para incrementar a beleza do seu setup. \n \n O layout no padrão brasileiro ABNT2 é ideal para quem vai usar o teclado para digitar. \n \n O layout no padrão brasileiro ABNT2 é ideal para quem vai usar o teclado para digitar.",
            "id": 7,
            "category": "teclado"
        },
        {
            "name": "Headset ThunderX Pro",
            "price": 249.5,
            "img": "/images/headset.png",
            "description": "Headset ThunderX Pro com som surround imersivo e microfone de cancelamento de ruído.",
            "id": 8,
            "category": "headset"
        },
        {
            "name": "Placa de Vídeo NitroForce GTX",
            "price": 2076.36,
            "img": "/images/placa.png",
            "description": "Placa de vídeo NitroForce GTX com 6GB GDDR6 para alta performance em jogos.",
            "id": 9,
            "category": "placa"
        },
        {
            "name": "Teclado Mecânico SteelWave",
            "price": 249,
            "img": "/images/teclado.png",
            "description": "Teclado mecânico SteelWave com switches rápidos e iluminação RGB personalizável.",
            "id": 10,
            "category": "teclado"
        },
        {
            "name": "Headset SonicBoom H300",
            "price": 230,
            "img": "/images/headset.png",
            "description": "Headset SonicBoom H300 com som cristalino e conforto para longas sessões.",
            "id": 11,
            "category": "headset"
        },
        {
            "name": "Placa de Vídeo HyperPower RX",
            "price": 2999.99,
            "img": "/images/placa.png",
            "description": "Placa de vídeo HyperPower RX com 8GB de memória dedicada, ideal para design e games.",
            "id": 12,
            "category": "placa"
        },
        {
            "name": "Teclado Gamer FireStrike",
            "price": 119,
            "img": "/images/teclado.png",
            "description": "Teclado gamer FireStrike com teclas anti-ghosting e suporte ergonômico.",
            "id": 13,
            "category": "teclado"
        },
        {
            "name": "Headset HyperWave 7.1",
            "price": 200,
            "img": "/images/headset.png",
            "description": "Headset HyperWave 7.1 com surround real e almofadas confortáveis.",
            "id": 14,
            "category": "headset"
        },
        {
            "name": "Placa de Vídeo Vortex GFX",
            "price": 3050,
            "img": "/images/placa.png",
            "description": "Placa de vídeo Vortex GFX com performance otimizada para jogos em 4K.",
            "id": 15,
            "category": "placa"
        },
        {
            "name": "Teclado Mecânico UltraKey",
            "price": 120,
            "img": "/images/teclado.png",
            "description": "Teclado mecânico UltraKey com switches silenciosos e retroiluminação ajustável.",
            "id": 16,
            "category": "teclado"
        },
        {
            "name": "Headset AudioBlaze 500",
            "price": 545.25,
            "img": "/images/headset.png",
            "description": "Headset AudioBlaze 500 com tecnologia de áudio avançada e microfone retrátil.",
            "id": 17,
            "category": "headset"
        },
        {
            "name": "Placa de Vídeo StormBlitz RTX",
            "price": 2345.31,
            "img": "/images/placa.png",
            "description": "Placa de vídeo StormBlitz RTX com ray tracing para gráficos ultrarrealistas.",
            "id": 18,
            "category": "placa"
        },
        {
            "name": "Teclado RGB PhantomKey",
            "price": 243.43,
            "img": "/images/teclado.png",
            "description": "Teclado RGB PhantomKey com iluminação dinâmica e teclas de resposta rápida.",
            "id": 19,
            "category": "teclado"
        },
        {
            "name": "Headset FusionX HD",
            "price": 123.31,
            "img": "/images/headset.png",
            "description": "Headset FusionX HD com som de alta definição e controle de volume no cabo.",
            "id": 20,
            "category": "headset"
        },
        {
            "name": "Placa de Vídeo NovaForce GTX",
            "price": 11624.65,
            "img": "/images/placa.png",
            "description": "Placa de vídeo NovaForce GTX com alta performance e resfriamento eficiente.",
            "id": 21,
            "category": "placa"
        },
        {
            "name": "Teclado Mecânico TitanStrike",
            "price": 189.9,
            "img": "/images/teclado.png",
            "description": "Teclado mecânico TitanStrike com teclas de baixa resistência e iluminação personalizável.",
            "id": 22,
            "category": "teclado"
        },
        {
            "name": "Headset UltraSound X100",
            "price": 129.9,
            "img": "/images/headset.png",
            "description": "Headset UltraSound X100 com áudio de precisão e almofadas macias para maior conforto.",
            "id": 23,
            "category": "headset"
        },
        {
            "name": "Placa de Vídeo PowerRay RX",
            "price": 5313.84,
            "img": "/images/placa.png",
            "description": "Placa de vídeo PowerRay RX com 12GB de memória GDDR6 e suporte a múltiplos monitores.",
            "id": 24,
            "category": "placa"
        }
    ],
    "categories": [
        { "id": "teclado", "value": "teclado", "label": "Teclado" },
        { "id": "placa", "value": "placa", "label": "Placa de Vídeo" },
        { "id": "headset", "value": "headset", "label": "Headset" }
    ],
    "cart": []
}
